"""
需求
1. 完成字符串的逆序以及统计
2. 设计一个程序，要求只能输入长度低于31的字符串，否则提示用户重新输入
3. 打印如下内容:
--------------------------------------------
您输入的字符串: zhongshanshan
长度: 13
逆序后为: nahsnahsgnohz
字符统计结果: z:1 h:3 o:1 n:3 g:1 s:2 a:2
--------------------------------------------

分析：
1. 输入字符串(while循环)
2. 字符串长度小于31位,否则提示重新输入
3. 您输入的字符串: ...
4. 长度: ...
5. 逆序后为: ...  (切片)
6. 字符统计结果: ...(afsfdsf)  a:1  f:3 s:2 d:1
"""
str1 = "zhongshanshan"
temp = {}
for i in str1:
    if i not in temp:
        temp[i] = 1
    else:
        temp[i] += 1
print(temp)

